Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallsOverlap
Highlighted walls overlap. One of them may be ignored when Revit finds room boundaries. Use Cut Geometry to embed one wall within the other.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallSpaceSeparationOverlap
A wall and a space separation line overlap. One of them may be ignored when Revit finds space boundaries.
Shorten or delete the space separation line to remove the overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallRoomSeparationOverlap
A wall and a room separation line overlap. One of them may be ignored when Revit finds room boundaries.
Shorten or delete the room separation line to remove the overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallAreaBoundaryOverlap
Wall and area boundary line overlap. Color fills, area tags and areas may not behave correctly.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.SpaceSeparationLinesOverlap
Highlighted space separation lines overlap. One of them may be ignored when Revit finds space boundaries. Delete one of the lines.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.RoomSeparationLinesOverlap
Highlighted room separation lines overlap. One of them may be ignored when Revit finds room boundaries. Delete one of the lines.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.OverlappingElementsTest
There are overlapping structural framing elements of the same type in the project found by Dynamic Update.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.LevelsOverlap
Highlighted levels overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.FloorsOverlap
Highlighted floors overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DuplicateRebar
There are identical rebar in the same place. This will result in double counting in schedules.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DuplicatePoints
There are identical points in the same place. Lines created from points may not work as expected.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DuplicateInstances
There are identical instances in the same place. This will result in double counting in schedules.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DuplicateFabricSheet
There are identical Fabric sheets in the same place. This will result in double counting in schedules.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DivisionSketchOverlap
Curves in the sketch of the Division overlap.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.CurvesOverlap
Highlighted lines overlap. Lines may not form closed loops.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.AreaBoundaryLinesOverlap
Highlighted area boundary lines overlap.  Color fills, area tags, and areas may not behave correctly.

Autodesk.Revit.DB.BuiltInFailures.OverlapFailures
Failures detected by overlap check.